# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [167]:
# import numpy and pandas
import scipy.stats as st
import pandas as pd
import statistics as stats
import numpy as np
import math
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline 
from sklearn.linear_model import LinearRegression
from sklearn import linear_model
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.preprocessing import MinMaxScaler, StandardScaler, OneHotEncoder  
from sklearn.model_selection import train_test_split
import zipfile

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents. Please, load the data using Ironhack's database (db: employees, table: employees_advanced).

In [168]:
# Your code here:
with zipfile.ZipFile("archive.zip","r") as zip_ref:
    zip_ref.extractall("archive.csv")

In [169]:
data = pd.read_csv('archive.csv/Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [170]:
# Your code here:
data.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [171]:
data.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [172]:
# Your code here:
data['Salary or Hourly'].value_counts()

Salary    24775
Hourly     7883
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [173]:
data.groupby(['Department']).agg({'Salary or Hourly': 'count'})

                       Salary or Hourly
Department
ADMIN HEARNG                         38
ANIMAL CONTRL                        73
AVIATION                           1612
BOARD OF ELECTION                   112
BOARD OF ETHICS                       8
BUDGET & MGMT                        44
BUILDINGS                           266
BUSINESS AFFAIRS                    168
CITY CLERK                           85
CITY COUNCIL                        400
COMMUNITY DEVELOPMENT               214
COPA                                 17
CULTURAL AFFAIRS                     76
DISABILITIES                         29
DoIT                                101
FAMILY & SUPPORT                    621
FINANCE                             575
FIRE                               4800
GENERAL SERVICES                    972
HEALTH                              516
HUMAN RELATIONS                      17
HUMAN RESOURCES                      68
INSPECTOR GEN                        63
IPRA                                 56
LAW                                 405
LICENSE APPL COMM                     1
MAYOR'S OFFICE                       85
OEMC                               2044
POLICE                            12973
POLICE BOARD                          2
PROCUREMENT                          86
PUBLIC LIBRARY                      932
STREETS & SAN                      2194
TRANSPORTN                         1103
TREASURER                            24
WATER MGMNT                        1878

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval. (meaning a 0.05 significance level)

In [174]:
data['Hourly Rate'] = data['Hourly Rate'].str.replace('$', '', regex = True).astype('float64')

In [175]:
hour_rate = data[['Hourly Rate']].dropna()

In [176]:
hour_rate

       Hourly Rate
11           14.51
54           19.66
56           46.10
57           35.60
60            2.65
...            ...
32639        46.10
32643        17.50
32644        35.60
32650        46.35
32651        48.85

[7883 rows x 1 columns]

In [177]:
# The hypothesis is that the mean of the 
# hourly wage is significatly different from 30/h.

# Our alpha is of 0.05 (p-value threshold)
# Two-sided test:
# H0: mean hourly wage = 30/h
# H1: mean hourly wage != 30/h - higher or lower

from scipy.stats import ttest_1samp

stat, pval = ttest_1samp(hour_rate, 30)

In [178]:
print('stat is  ', stat) #how far away it can go from the hypothisised value of 30. How many standard error is the value of 30 away from the mean.
print('pvalue for the two-tailed test is ', pval)

stat is   [21.00353219]
pvalue for the two-tailed test is  [2.40480114e-95]

In [179]:
#We can look at the p-value and see how it is much lower than 0.05 (significance level). We have therefore evidence to reject H0 and assume H1.

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [180]:
data_pol = data[((data['Department'].isin(['POLICE'])) & (data['Salary or Hourly'] == 'Salary'))]

In [181]:
data_pol

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN
...,...,...,...,...,...,...,...,...
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN

In [182]:
annual_pol_salary = data_pol['Annual Salary'].dropna().str.replace('$', '', regex = True).astype('float64')

In [183]:
# Hypothesises: last year's mean annual salary for the police force is higher than 86000/y.

# We select a value for alpha of 0.05 (p-value threshold)

# One-sided test:
# Null hypothesis or H0: mean annual salary <= 86000/y
# Alternative hyp or H1: mean annual salary > 86000/y

stat, pval = ttest_1samp(annual_pol_salary, 86000)

In [184]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)
print('pvalue for the one-tailed test is ', pval/2)

stat is   12.573116980151957
pvalue for the two-tailed test is  4.8201971480060955e-36
pvalue for the one-tailed test is  2.4100985740030478e-36

In [185]:
np.mean(annual_pol_salary)

87836.02534889111

In [186]:
st.sem(annual_pol_salary)*12.573

1836.008266530019

In [187]:
86000 + 1836.00

87836.0

In [188]:
# Looking at both the stat and the p-value for one-tailed test, one can infer that it is possible to reject H0, therefore, confirm the hypothesis that salaries are higher than 86000/y for all the police force. The stats is positive and the p-value is much lower than 0.05.

Using the `crosstab` function, find the department that has the most hourly workers.

In [189]:
data_crosstab = pd.crosstab(data['Department'], data['Salary or Hourly'], margins = False)
data_crosstab

Salary or Hourly       Hourly  Salary
Department
ADMIN HEARNG                0      38
ANIMAL CONTRL              16      57
AVIATION                 1056     556
BOARD OF ELECTION           0     112
BOARD OF ETHICS             0       8
BUDGET & MGMT               1      43
BUILDINGS                   0     266
BUSINESS AFFAIRS            8     160
CITY CLERK                  3      82
CITY COUNCIL               52     348
COMMUNITY DEVELOPMENT       4     210
COPA                        0      17
CULTURAL AFFAIRS           10      66
DISABILITIES                0      29
DoIT                        0     101
FAMILY & SUPPORT          300     321
FINANCE                    43     532
FIRE                        2    4798
GENERAL SERVICES          767     205
HEALTH                      4     512
HUMAN RELATIONS             0      17
HUMAN RESOURCES             1      67
INSPECTOR GEN               0      63
IPRA                        0      56
LAW                        44     361
LICENSE APPL COMM           0       1
MAYOR'S OFFICE              7      78
OEMC                     1212     832
POLICE                     32   12941
POLICE BOARD                0       2
PROCUREMENT                 4      82
PUBLIC LIBRARY            224     708
STREETS & SAN            1873     321
TRANSPORTN                707     396
TREASURER                   1      23
WATER MGMNT              1512     366

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [190]:
data_san = data[data['Department'].isin(['STREETS & SAN'])]

san_hourly_salary = data_san['Hourly Rate'].dropna()

In [191]:
san_hourly_salary

57       35.60
73       20.77
76       35.60
85       36.21
88       35.60
         ...
32582    35.60
32623    35.60
32624    36.21
32631    21.43
32637    36.21
Name: Hourly Rate, Length: 1873, dtype: float64

In [192]:
# Hypothesises: mean hourly salary for San is less than 35/h.

# We select a value for alpha of 0.05 (p-value threshold)

# One-sided test:
# Null hypothesis or H0: mean hourly salary >= 35/h
# Alternative hyp or H1: mean hourly salary < 35/h

stat, pval = ttest_1samp(san_hourly_salary, 35)

In [193]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)
print('pvalue for the one-tailed test is ', pval/2)

stat is   -7.172610090911691
pvalue for the two-tailed test is  1.0552486304260417e-12
pvalue for the one-tailed test is  5.276243152130208e-13

In [194]:
np.mean(san_hourly_salary)

34.06726641751145

In [195]:
st.sem(san_hourly_salary)*-7.172

-0.9326542456392718

In [196]:
35 - 0.9326542456392718

34.06734575436073

In [197]:
#Since the one-tailed p-value in this case is very low, we can reject H0 and provide evidence that the mean hourly salary for Streets and San is lower than 35/h.

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [198]:
hour_rate

       Hourly Rate
11           14.51
54           19.66
56           46.10
57           35.60
60            2.65
...            ...
32639        46.10
32643        17.50
32644        35.60
32650        46.35
32651        48.85

[7883 rows x 1 columns]

In [199]:
confidence_level = 0.95
degrees_freedom = len(hour_rate) - 1
sample_mean = np.mean(hour_rate)
sample_standard_error = st.sem(hour_rate)
confidence_interval = st.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

In [200]:
print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (array([32.60050319]), array([33.13588143])) .

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [201]:
confidence_level = 0.95
degrees_freedom = len(annual_pol_salary) - 1
sample_mean = np.mean(annual_pol_salary)
sample_standard_error = st.sem(annual_pol_salary)
confidence_interval = st.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

print( 'confidence interval is ', confidence_interval, '.' )

confidence interval is  (87549.78923170577, 88122.26146607645) .

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [207]:
display(data['Salary or Hourly'].value_counts())
display(data.shape)
#Total of 7883 hourly workers in a population of 32658.

Salary    24775
Hourly     7883
Name: Salary or Hourly, dtype: int64

(32658, 8)

24.13803662196093

In [211]:
#H0: The proportion of hourly workers in Chicago is 25%.
#H1: The proportion of hourly workers in Chicago is not 25%.
from statsmodels.stats.proportion import proportions_ztest
#proportions_ztest(count, nobs, value=None, alternative='two-sided', prop_var=False)[source]
significance_level =  0.05
count = 7883 #the number of successes in nobs trials.
nobs = 32658 #the number of trials or observations
null_hypothesis = 0.25
stat, p_value = proportions_ztest(count=count, nobs=nobs, value=null_hypothesis, alternative='larger')

In [212]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)
print('pvalue for the one-tailed test is ', pval/2)

stat is   -3.6401610358268113
pvalue for the two-tailed test is  1.0552486304260417e-12
pvalue for the one-tailed test is  5.276243152130208e-13

In [ ]:
#The p-value shows that we can reject H0, and that there is evidence to assume that the proportion of hourly workers in Chicago is not 25%.